# เลือกภาพหลัก (จาก Docker Hub) เป็นรันไทม์เริ่มต้นในการเรียกโปรเจกต์
# ที่นี่เราเลือกภาพโหนดรุ่น 18
FROM node:18

# กำหนดไดเรกทอรีทำงานในคอนเทนเนอร์ (เมื่อรัน)
WORKDIR /usr/src/app

# คัดลอกไฟล์ package.json จากเครื่องท้องถิ่นเข้าไปในคอนเทนเนอร์
COPY package.json .

# ติดตั้ง Node.js dependencies
RUN npm install

# คัดลอกไฟล์ index.html เข้าคอนเทนเนอร์
COPY index.html .

# คัดลอกไฟล์ index.js เข้าคอนเทนเนอร์
COPY index.js .

# เปิดเผยพอร์ต 8000 เพื่อให้เข้าถึงได้
EXPOSE 8001 

# กำหนดคำสั่งเพื่อเริ่มการรันแอปเมื่อคอนเทนเนอร์เริ่มทำงาน
CMD ["node", "index.js"]

